**<h1>Data cleaning</h1>**
**Import pandas library and create example data frame**

In [4]:
import pandas as pd

data = {
    'A': [1,1,2,2,3,4],
    'B': ['x','x','y','y','z','v'],
    'C': [100,100,200,200,300,400]
}

df = pd.DataFrame(data)
df

   A  B    C
0  1  x  100
1  1  x  100
2  2  y  200
3  2  y  200
4  3  z  300
5  4  v  400

In [5]:
# Dropping duplicates
df_unique = df.drop_duplicates()
df_unique

   A  B    C
0  1  x  100
2  2  y  200
4  3  z  300
5  4  v  400

Keeping the **first** occurence of the duplicate value

In [7]:
df_first = df.drop_duplicates(keep='first')
df_first

   A  B    C
0  1  x  100
2  2  y  200
4  3  z  300
5  4  v  400

Keeping the **last** occurence of the duplicate value

In [6]:
df_last = df.drop_duplicates(keep='last')
df_last

   A  B    C
1  1  x  100
3  2  y  200
4  3  z  300
5  4  v  400

In [8]:
df_unique_cols = df.drop_duplicates(subset=['A','B'])
df_unique_cols

   A  B    C
0  1  x  100
2  2  y  200
4  3  z  300
5  4  v  400

Dropping all duplicates in the data frame

In [9]:
df_drop_all = df.drop_duplicates(keep=False)
df_drop_all

   A  B    C
4  3  z  300
5  4  v  400

To alternate the original data frame and drop the duplicates for good use 'inplace=True'

In [10]:
df.drop_duplicates(inplace=True)
df

   A  B    C
0  1  x  100
2  2  y  200
4  3  z  300
5  4  v  400